
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 7 to destroy.</code></pre>

* Create
  * module.pre_api[0].azurerm_api_management_api.api
  * module.pre_api[0].azurerm_api_management_product_api.link_to_product[0]
  * module.pre_product[0].azurerm_api_management_product.product
* Update
  * azurerm_media_services_account.ams
  * module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account
* Delete
  * azurerm_eventgrid_event_subscription.ams_health_event
  * azurerm_eventgrid_event_subscription.ams_state_event
  * azurerm_eventgrid_topic.ams_eventgrid_topic
  * azurerm_media_services_account_filter.ams_filter
  * module.ams_api[0].azurerm_api_management_api.api
  * module.ams_api[0].azurerm_api_management_product_api.link_to_product[0]
  * module.ams_product[0].azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventgrid_event_subscription.ams_health_event will be destroyed
  # (because azurerm_eventgrid_event_subscription.ams_health_event is not in configuration)
  - resource "azurerm_eventgrid_event_subscription" "ams_health_event" {
      - advanced_filtering_on_arrays_enabled = false -> null
      - event_delivery_schema                = "EventGridSchema" -> null
      - id                                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Media/mediaServices/preamssbox/providers/Microsoft.EventGrid/eventSubscriptions/pre-timestamp-mgmt-sbox-PRE-EventHealthMonitoring" -> null
      - included_event_types                 = [
          - "Microsoft.Media.LiveEventEncoderConnected",
          - "Microsoft.Media.LiveEventIncomingStreamReceived",
          - "Microsoft.Media.LiveEventEncoderDisconnected",
        ] -> null
      - labels                               = [] -> null
      - name                                 = "pre-timestamp-mgmt-sbox-PRE-EventHealthMonitoring" -> null
      - scope                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Media/mediaServices/preamssbox" -> null

      - advanced_filter {
          - string_contains {
              - key    = "subject" -> null
              - values = [
                  - "EncodetoMP4",
                ] -> null
            }
        }

      - azure_function_endpoint {
          - function_id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Web/sites/pre-ams-integration-sbox/functions/GenerateVtt" -> null
          - max_events_per_batch              = 1 -> null
          - preferred_batch_size_in_kilobytes = 64 -> null
        }

      - retry_policy {
          - event_time_to_live    = 1440 -> null
          - max_delivery_attempts = 30 -> null
        }
    }

  # azurerm_eventgrid_event_subscription.ams_state_event will be destroyed
  # (because azurerm_eventgrid_event_subscription.ams_state_event is not in configuration)
  - resource "azurerm_eventgrid_event_subscription" "ams_state_event" {
      - advanced_filtering_on_arrays_enabled = false -> null
      - event_delivery_schema                = "EventGridSchema" -> null
      - id                                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Media/mediaServices/preamssbox/providers/Microsoft.EventGrid/eventSubscriptions/pre-timestamp-mgmt-sbox-TransformJobTimestampEvent" -> null
      - included_event_types                 = [
          - "Microsoft.Media.JobOutputStateChange",
        ] -> null
      - labels                               = [] -> null
      - name                                 = "pre-timestamp-mgmt-sbox-TransformJobTimestampEvent" -> null
      - scope                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Media/mediaServices/preamssbox" -> null

      - advanced_filter {
          - string_contains {
              - key    = "subject" -> null
              - values = [
                  - "EncodetoMP4",
                ] -> null
            }
        }

      - azure_function_endpoint {
          - function_id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Web/sites/pre-ams-integration-sbox/functions/GenerateVtt" -> null
          - max_events_per_batch              = 1 -> null
          - preferred_batch_size_in_kilobytes = 64 -> null
        }

      - retry_policy {
          - event_time_to_live    = 1440 -> null
          - max_delivery_attempts = 30 -> null
        }
    }

  # azurerm_eventgrid_topic.ams_eventgrid_topic will be destroyed
  # (because azurerm_eventgrid_topic.ams_eventgrid_topic is not in configuration)
  - resource "azurerm_eventgrid_topic" "ams_eventgrid_topic" {
      - endpoint                      = "https://exampletopic.uksouth-1.eventgrid.azure.net/api/events" -> null
      - id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.EventGrid/topics/exampleTopic" -> null
      - inbound_ip_rule               = [] -> null
      - input_schema                  = "EventGridSchema" -> null
      - local_auth_enabled            = true -> null
      - location                      = "uksouth" -> null
      - name                          = "exampleTopic" -> null
      - primary_access_key            = (sensitive value) -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "pre-sbox" -> null
      - secondary_access_key          = (sensitive value) -> null
      - tags                          = {
          - "application"         = "pre-recorded-evidence"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "sandbox"
          - "expiresAfter"        = "3000-01-01"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
    }

  # azurerm_media_services_account.ams will be updated in-place
  ~ resource "azurerm_media_services_account" "ams" {
        id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Media/mediaServices/preamssbox"
        name                          = "preamssbox"
        tags                          = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (4 unchanged attributes hidden)

      ~ identity {
          ~ type         = "SystemAssigned, UserAssigned" -> "UserAssigned"
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # azurerm_media_services_account_filter.ams_filter will be destroyed
  # (because azurerm_media_services_account_filter.ams_filter is not in configuration)
  - resource "azurerm_media_services_account_filter" "ams_filter" {
      - first_quality_bitrate       = 0 -> null
      - id                          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Media/mediaServices/preamssbox/accountFilters/amsFilter" -> null
      - media_services_account_name = "preamssbox" -> null
      - name                        = "amsFilter" -> null
      - resource_group_name         = "pre-sbox" -> null
    }

  # module.ams_api[0].azurerm_api_management_api.api will be destroyed
  # (because azurerm_api_management_api.api is not in configuration)
  - resource "azurerm_api_management_api" "api" {
      - api_management_name   = "sds-api-mgmt-sbox" -> null
      - api_type              = "http" -> null
      - display_name          = "toffee-recipes" -> null
      - id                    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/apis/toffee-recipes-api" -> null
      - is_current            = true -> null
      - is_online             = false -> null
      - name                  = "toffee-recipes-api" -> null
      - path                  = "toffee-recipes-api" -> null
      - protocols             = [
          - "https",
        ] -> null
      - resource_group_name   = "ss-sbox-network-rg" -> null
      - revision              = "1" -> null
      - service_url           = "http://toffee-recipe-backend-sbox.service.core-compute-sbox.internal" -> null
      - soap_pass_through     = false -> null
      - subscription_required = true -> null

      - import {
          - content_format = "openapi+json-link" -> null
          - content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/sds-toffee-recipes-service.json" -> null
        }

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

  # module.ams_api[0].azurerm_api_management_product_api.link_to_product[0] will be destroyed
  # (because azurerm_api_management_product_api.link_to_product is not in configuration)
  - resource "azurerm_api_management_product_api" "link_to_product" {
      - api_management_name = "sds-api-mgmt-sbox" -> null
      - api_name            = "toffee-recipes-api" -> null
      - id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/products/pre-ams-integration/apis/toffee-recipes-api" -> null
      - product_id          = "pre-ams-integration" -> null
      - resource_group_name = "ss-sbox-network-rg" -> null
    }

  # module.ams_product[0].azurerm_api_management_product.product will be destroyed
  # (because azurerm_api_management_product.product is not in configuration)
  - resource "azurerm_api_management_product" "product" {
      - api_management_name   = "sds-api-mgmt-sbox" -> null
      - approval_required     = false -> null
      - display_name          = "pre-ams-integration" -> null
      - id                    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/products/pre-ams-integration" -> null
      - product_id            = "pre-ams-integration" -> null
      - published             = true -> null
      - resource_group_name   = "ss-sbox-network-rg" -> null
      - subscription_required = false -> null
      - subscriptions_limit   = 0 -> null
    }

  # module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupsbox"
        name                              = "preingestsabackupsbox"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (37 unchanged attributes hidden)

      ~ immutability_policy {
          ~ period_since_creation_in_days = 7 -> 1
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.pre_api[0].azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "sds-api-mgmt-sbox"
      + api_type              = "http"
      + display_name          = "pre-api"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "pre-api"
      + path                  = "pre-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "ss-sbox-network-rg"
      + revision              = "1"
      + service_url           = "http://pre-api-{{ .Values.global.environment }}}.service.core-compute-sbox.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json-link"
          + content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/pre-api.json"
        }
    }

  # module.pre_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-sbox"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + product_id          = "pre-api"
      + resource_group_name = "ss-sbox-network-rg"
    }

  # module.pre_product[0].azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "sds-api-mgmt-sbox"
      + approval_required     = false
      + display_name          = "pre-api"
      + id                    = (known after apply)
      + product_id            = "pre-api"
      + published             = true
      + resource_group_name   = "ss-sbox-network-rg"
      + subscription_required = false
      + subscriptions_limit   = 20
    }

Plan: 3 to add, 2 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":631,"Program":"tfcmt","SHA1":"","Vars":{}} -->